#### Terraform Format and Style 🖌``
#### Terraform Initialization ⚙️``
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```

terraform
module.shared.data.terraform_remote_state.infrastructure_state: Reading...
module.shared.data.terraform_remote_state.infrastructure_state: Read complete after 1s

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
+/- create replacement and then destroy

Terraform will perform the following actions:

  # module.buckets.aws_s3_bucket_object.add_investment_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "add_investment_function_object" {
      ~ etag                   = "57e7df2d7008c3c7b65eb26cdda799c5" -> "2104c865ddb53450a01ac75b8b3803d6"
        id                     = "lambdas/demo/add_investment_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.add_scenario_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "add_scenario_function_object" {
      ~ etag                   = "3788f3ca9847cb837dbd887e44d7aab9" -> "184f7ae219ff29ca788684a4a95a2a1a"
        id                     = "lambdas/demo/add_scenario_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.add_tag_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "add_tag_function_object" {
      ~ etag                   = "50cfe056180b1f3ced2c0fb951fb6c3d" -> "a4c85bcfa6055962ce6f2b1b648d49cd"
        id                     = "lambdas/demo/add_tag_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.add_user_to_customer_group_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "add_user_to_customer_group_function_object" {
      ~ etag                   = "3338b0ae0fabef57b7178c9412547a20" -> "27accc755274e8955d4e54f26c069418"
        id                     = "lambdas/demo/add_user_to_customer_group_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.assign_company_permissions_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "assign_company_permissions_function_object" {
      ~ etag                   = "4128595fb4896322d51a0f88da9865a2" -> "558cc6e17ba3be1b0d29aa299e7c1172"
        id                     = "lambdas/demo/assign_company_permissions_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.authorize_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "authorize_function_object" {
      ~ etag                   = "4d5a2ed77bc7429d702c26f61da5cbf4" -> "1db69feb3a67f64f146e778245d57315"
        id                     = "lambdas/demo/authorize_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.change_company_publicly_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "change_company_publicly_function_object" {
      ~ etag                   = "4cad8c9e52c160d034dee79d9aeb4e19" -> "c8ee2f7a854f79d39171249b6396a971"
        id                     = "lambdas/demo/change_company_publicly_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.change_user_role_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "change_user_role_function_object" {
      ~ etag                   = "81b6db2cec02158a020b21f57782af4e" -> "236688b3d357e5ad55bfcd4f813cb3b0"
        id                     = "lambdas/demo/change_user_role_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.connect_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "connect_function_object" {
      ~ etag                   = "82b1947b91029fb01001a5f73695b2a4" -> "a1adbb9dca28d9d4aa39ce6e79812d20"
        id                     = "lambdas/demo/connect.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.delete_company_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "delete_company_function_object" {
      ~ etag                   = "b92ffb7d131303149f999989018ac2d0" -> "3c04142f40ffec00009f62b19068fc40"
        id                     = "lambdas/demo/delete_company_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.delete_scenarios_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "delete_scenarios_function_object" {
      ~ etag                   = "30efeda4f726b03946fc99aba22dacb2" -> "0511fc72c907c9919160481d8f6a23f2"
        id                     = "lambdas/demo/delete_scenarios_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.delete_tags_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "delete_tags_function_object" {
      ~ etag                   = "0094a083cc567a2205f013ad94864190" -> "d03e4330992d310f86c8887a9f9056af"
        id                     = "lambdas/demo/delete_tags_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.disconnect_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "disconnect_function_object" {
      ~ etag                   = "b6054a6d436b75f795c5f95343aee14e" -> "d755af16412ba7fa28f8a33980bb273f"
        id                     = "lambdas/demo/disconnect.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.download_comparison_vs_peers_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "download_comparison_vs_peers_function_object" {
      ~ etag                   = "b18d05f276b6a4cb86ba1e43e9082b20" -> "caf01e93710a7104c9253f316cb35961"
        id                     = "lambdas/demo/download_comparison_vs_peers_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.edit_modify_data_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "edit_modify_data_function_object" {
      ~ etag                   = "c43d1e3824da4a3b97af210ea673eb0e" -> "36e11aa288b66d13ab3c90a0def3047b"
        id                     = "lambdas/demo/edit_modify_data_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_all_companies_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_all_companies_function_object" {
      ~ etag                   = "73a3525e82c21ca7deb6837e6cf33b6e" -> "6fe6c2173bc35eca533bbb0a8faf69cb"
        id                     = "lambdas/demo/get_all_companies_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_all_public_companies_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_all_public_companies_function_object" {
      ~ etag                   = "17a6ba5c446649365c7596118d0160d3" -> "106d24d96a886b3a2818fdbeb3d0d507"
        id                     = "lambdas/demo/get_all_public_companies_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_all_ranges_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_all_ranges_function_object" {
      ~ etag                   = "c9c8aafa641cc76599683a4eb6c0c1a1" -> "c2b326cbfaeffab2a767355afd248be2"
        id                     = "lambdas/demo/get_all_ranges_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_all_tags_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_all_tags_function_object" {
      ~ etag                   = "bff862d2d38f219185c99699dfa1032c" -> "1f5f134e120c5c4cbaebbf033daa2af7"
        id                     = "lambdas/demo/get_all_tags_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_by_metric_report_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_by_metric_report_function_object" {
      ~ etag                   = "4847992625bfadd227ff0bd118552f64" -> "a3b30f576ce21da9f63c2017a2b1bb20"
        id                     = "lambdas/demo/get_by_metric_report_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_company_details_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_company_details_function_object" {
      ~ etag                   = "843f85011caed13e338e200803aa1b21" -> "d6339ddb75d8075520e27a47bdeeb176"
        id                     = "lambdas/demo/get_company_details_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_company_investments_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_company_investments_function_object" {
      ~ etag                   = "329024f0a63139263902c9e15e0cee2c" -> "a65cec854983b861dbb91098799ef537"
        id                     = "lambdas/demo/get_company_investments_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_company_permissions_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_company_permissions_function_object" {
      ~ etag                   = "729dfcb9ef73047e0fb962337a133876" -> "da014238b338855f60a20573634c7676"
        id                     = "lambdas/demo/get_company_permissions_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_company_report_vs_peers_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_company_report_vs_peers_function_object" {
      ~ etag                   = "7feffae0a98bbadffeec6a058b6f1005" -> "9520b07ba0941e51d82142fb2f758488"
        id                     = "lambdas/demo/get_company_report_vs_peers_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_comparison_vs_peers_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_comparison_vs_peers_function_object" {
      ~ etag                   = "faa82e5a9ae8b0ddd4db9bc742214b84" -> "dafdb31f0dc94726603f4f299dd8bb22"
        id                     = "lambdas/demo/get_comparison_vs_peers_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_dynamic_report_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_dynamic_report_function_object" {
      ~ etag                   = "73ae59aa85ace038963371d0e2fa8da1" -> "fa67e3e52bc00268d55eaf2a0c8ebd84"
        id                     = "lambdas/demo/get_dynamic_report_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_edit_modify_data_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_edit_modify_data_function_object" {
      ~ etag                   = "4e65a87c18a074fcdbc7901add4798fe" -> "2b20101b562a15971a5b8e9c514972a1"
        id                     = "lambdas/demo/get_edit_modify_data_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_full_year_total_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_full_year_total_function_object" {
      ~ etag                   = "6ba2428a7658baca45fb9bc9b395c630" -> "29b2d1512aca1ac0af34f41fc1460286"
        id                     = "lambdas/demo/get_full_year_total_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_investment_date_report_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_investment_date_report_function_object" {
      ~ etag                   = "ceaf4e0abf3fbe0e6084d53e18d4e887" -> "69cfcd0bf72371db166863a4b407f675"
        id                     = "lambdas/demo/get_investment_date_report_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_metric_types_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_metric_types_function_object" {
      ~ etag                   = "d61b469d306a7979ef5b8cf766e37f2d" -> "709d5e578d80dceb42648feac0769579"
        id                     = "lambdas/demo/get_metric_types_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_quarters_report_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_quarters_report_function_object" {
      ~ etag                   = "e5a81844d54291b93e7f5be1aaf55e2c" -> "98ec0724a20ce15d96e564e1a487b038"
        id                     = "lambdas/demo/get_quarters_report_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_ranges_by_metric_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_ranges_by_metric_function_object" {
      ~ etag                   = "93ef87cfd24f93ebfc7475296a4b212b" -> "2933dc9ab5033a28bfe075d8dad916f4"
        id                     = "lambdas/demo/get_ranges_by_metric_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_roles_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_roles_function_object" {
      ~ etag                   = "d389acca54530a36b5461c3b72f7ddaf" -> "dc00f93f6ce4e4c6c9d09332f6a9667d"
        id                     = "lambdas/demo/get_roles_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_tags_by_company_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_tags_by_company_function_object" {
      ~ etag                   = "59b202daae3eb987a792b3235ba33a9f" -> "efeaaf92fad41301bf50b67747be213c"
        id                     = "lambdas/demo/get_tags_by_company_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_universe_overview_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_universe_overview_function_object" {
      ~ etag                   = "7ffa0824538bb8aaa7c1e01e758bce4a" -> "a833861de64db756c830e25938b04500"
        id                     = "lambdas/demo/get_universe_overview_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_user_details_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_user_details_function_object" {
      ~ etag                   = "410744dd310b75ddd72c69d9c692a0c9" -> "3ddd2c9126927d42dd6e58e33ba74d2f"
        id                     = "lambdas/demo/get_user_details_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_users_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_users_function_object" {
      ~ etag                   = "65b7280c8faa0d2a3d1054f667b8fea0" -> "7614a171599617d4a11ca9616b0311aa"
        id                     = "lambdas/demo/get_users_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.glue_trigger_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "glue_trigger_function_object" {
      ~ etag                   = "b25a9d77a1b23a599e80d1a43d6077a7" -> "e48f89476bbb2a8f0a4aa559f83747a0"
        id                     = "lambdas/demo/glue_trigger_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.layer_libraries_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "layer_libraries_object" {
      ~ etag                   = "45b55f3b8cd5f52c117f04c3a028e2e8" -> "5d9693c8f78faa96087fc1c3fa6bcdda"
        id                     = "layer/demo/layer_libraries.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.message_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "message_function_object" {
      ~ etag                   = "8e99825a2b9d9bbd16fb92d155271739" -> "67965877b58e23107e7cddcdc325a2df"
        id                     = "lambdas/demo/message.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.modify_ranges_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "modify_ranges_function_object" {
      ~ etag                   = "0c4d1a4b9125b515e0c8ec194bce82ac" -> "e84550612650991be9d1ef53170c9bb3"
        id                     = "lambdas/demo/modify_ranges_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.register_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "register_function_object" {
      ~ etag                   = "a82aa38a051f8139e9ac98a867339815" -> "d9f0f909d1f4b5353da15ec09f5f08a6"
        id                     = "lambdas/demo/register.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.update_data_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "update_data_function_object" {
      ~ etag                   = "d19aaae81f73f1a9ffd0e1ccc0473c21" -> "bdb15b13c0f2246c7971fd1e4493aa06"
        id                     = "lambdas/demo/update_data.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.update_tags_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "update_tags_function_object" {
      ~ etag                   = "c9202f098bd7304518dd5e09b9ad78ee" -> "b0b770882aa558ba1eab978383fd4f87"
        id                     = "lambdas/demo/update_tags_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.upload_file_s3_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "upload_file_s3_function_object" {
      ~ etag                   = "571f0a65a82dd60396a6ca7290ef34d1" -> "1b1cf57abe4c2b275b0457de52a8455e"
        id                     = "lambdas/demo/upload_file_s3_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.validate_data_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "validate_data_function_object" {
      ~ etag                   = "406f4a95ec5b6dfc867ccfb975280aaa" -> "ba00311f66c4a96806a20683a8658e29"
        id                     = "lambdas/demo/validate_data_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.verify_users_with_same_email_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "verify_users_with_same_email_function_object" {
      ~ etag                   = "bcdf3a62cb64a2e81e65c6902814564c" -> "fc0a767976f747d3b80f4cf888a1f22d"
        id                     = "lambdas/demo/verify_users_with_same_email_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.functions.aws_lambda_function.add_investment_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "add_investment_lambda_function" {
        id                             = "demo_add_investment_lambda_function"
      ~ last_modified                  = "2023-02-03T07:41:44.000+0000" -> (known after apply)
      ~ source_code_hash               = "xwm+aoys4laM3glwLemKzM31dQ0S0TfzM8OakW2iMdU=" -> "2D5tAJD0/WRFW6cE2BaLZnnyDp81qbTbQpKidAB8Bbs="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.add_scenario_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "add_scenario_lambda_function" {
        id                             = "demo_add_scenario_lambda_function"
      ~ last_modified                  = "2023-02-03T07:41:56.000+0000" -> (known after apply)
      ~ source_code_hash               = "m99kbbBh/8Q7UC1QfN2CVFAcRsqXVwQIbm/tvu263D4=" -> "Wr7iBuo9I4UkSIdpSMbDJtZowPQIHJ0YPyoa3fhZ4qw="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.add_tag_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "add_tag_lambda_function" {
        id                             = "demo_add_tag_lambda_function"
      ~ last_modified                  = "2023-02-03T07:41:43.000+0000" -> (known after apply)
      ~ source_code_hash               = "TiBSblOERlt/sHuMucn8SpfVwQJnf1QVqgxSQtDv4Ks=" -> "0UmFkZCL1Hogp2ZUV/vIRpOzc53wHJZbGu69H3uSGqE="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.add_user_to_customer_group_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "add_user_to_customer_group_lambda_function" {
        id                             = "demo_add_user_to_customer_group_lambda_function"
      ~ last_modified                  = "2023-02-03T07:42:05.000+0000" -> (known after apply)
      ~ source_code_hash               = "lKJ4ChD3apQMyojKFi1pRATz7B7ueuKVyxNYhixuDGg=" -> "YCL7TJpYBocPUxMDeBb/fIaBY9KBbqCQYy5REBx9Fxs="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.assign_company_permissions_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "assign_company_permissions_lambda_function" {
        id                             = "demo_assign_company_permissions_lambda_function"
      ~ last_modified                  = "2023-02-03T07:41:28.000+0000" -> (known after apply)
      ~ source_code_hash               = "zHFS1w/N4akZ+41NlR/AF21rCMZyuNSwO1xjwcCPMoM=" -> "iKcVMftqJ3aWHh90xrCvdWoQXw+dmovpfDa0eL/yl7Q="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.authorize_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "authorize_lambda_function" {
        id                             = "demo_authorize_lambda_function"
      ~ last_modified                  = "2023-02-03T07:41:45.000+0000" -> (known after apply)
      ~ source_code_hash               = "+oga4d977S0jr5/DOZ1veVxyJZhk3NXZNK4nYJC9tFw=" -> "hLKLwmQaDrwxdFMq1KDLhL0wqie89cl5CRXSdfbrXrc="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.change_company_publicly_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "change_company_publicly_lambda_function" {
        id                             = "demo_change_company_publicly_lambda_function"
      ~ last_modified                  = "2023-02-03T07:41:29.000+0000" -> (known after apply)
      ~ source_code_hash               = "1h9QqJPG4IQpGmZ0i6f6yuQdbz/8dPGuwl0oobhCCLY=" -> "BparbegVyOKUH2TfrqN49/eQ0/3tGJcKHq1RHf4ZLYs="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.change_user_role_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "change_user_role_lambda_function" {
        id                             = "demo_change_user_role_lambda_function"
      ~ last_modified                  = "2023-02-03T07:41:53.000+0000" -> (known after apply)
      ~ source_code_hash               = "dy0wEB93P2GPMkNkfihQqZwUzPkSHGyez2jaoaMWVKE=" -> "mU62yjdxAGpXJONsQz/2tny54CcCSP26VLituyl2oPE="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.connect_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "connect_lambda_function" {
        id                             = "demo_connect_lambda_function"
      ~ last_modified                  = "2023-02-03T07:41:29.000+0000" -> (known after apply)
      ~ source_code_hash               = "mNftg8hYhgqvf7yDw8/NuyDB8idr1TMwcrZEclNwoeQ=" -> "zd2olve7eWm/Qn2CkS1NipvRwAt0tMO0Z5QlcyaZflk="
        tags                           = {}
        # (18 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.functions.aws_lambda_function.delete_company_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "delete_company_lambda_function" {
        id                             = "demo_delete_company_lambda_function"
      ~ last_modified                  = "2023-02-03T07:42:05.000+0000" -> (known after apply)
      ~ source_code_hash               = "I3IpC2DozXpvIbxZme9P0SSO0e1dzGJgjAo3FG9n/SY=" -> "hDqSDwYdy00lVt7zVkAoWcJh1P0kfGK1ciOg3AbNtR8="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.delete_scenarios_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "delete_scenarios_lambda_function" {
        id                             = "demo_delete_scenarios_lambda_function"
      ~ last_modified                  = "2023-02-03T07:41:31.000+0000" -> (known after apply)
      ~ source_code_hash               = "Bapcxv+aAgBT+OaCYQnOLleDT29WTZl9FmiNGovy2cM=" -> "5L3unUblwxfrsvUx2wDeCjmnnTTkq3z4rh33TnIqffY="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.delete_tags_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "delete_tags_lambda_function" {
        id                             = "demo_delete_tags_lambda_function"
      ~ last_modified                  = "2023-02-03T07:41:55.000+0000" -> (known after apply)
      ~ source_code_hash               = "YklKY07FPBupAVSJ/tNsTlvmB4Cx5TwC6nX/9YzsNGU=" -> "4p+6N64ftQZRqk1jzcweYALCpN2ruqr3Ep3PfbyWIto="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.disconnect_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "disconnect_lambda_function" {
        id                             = "demo_disconnect_lambda_function"
      ~ last_modified                  = "2023-02-03T07:41:29.000+0000" -> (known after apply)
      ~ source_code_hash               = "4EYGTiheQ5QO5OquoKW08kPFo5Atk5DE+/Ho6U5R/Og=" -> "j4Ya3B6GhQJKBvs8JbjDhzCocPeweSCeOxrurMeuRqQ="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.download_comparison_vs_peers_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "download_comparison_vs_peers_lambda_function" {
        id                             = "demo_download_comparison_vs_peers_lambda_function"
      ~ last_modified                  = "2023-02-03T07:42:05.000+0000" -> (known after apply)
      ~ source_code_hash               = "VQ49ajF8i8BCcwWYMbTry8CIajm/WN9JyfpBaEZ7lDI=" -> "tb63ljUoQCbvQvgDe3v4WBqQ9IbIOJwMFeabjiMkDmI="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.edit_modify_data_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "edit_modify_data_lambda_function" {
        id                             = "demo_edit_modify_data_lambda_function"
      ~ last_modified                  = "2023-02-03T07:42:05.000+0000" -> (known after apply)
      ~ source_code_hash               = "9BYQf1zMDeQ7VxmEz6/3VDab8Do7P2ddG9Nbd9UM/ME=" -> "Ndw5ODiQIa93PX1y/7OI8mr86xp6VoJwhOarexHXBYw="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_all_companies_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_all_companies_lambda_function" {
        id                             = "demo_get_all_companies_lambda_function"
      ~ last_modified                  = "2023-02-03T07:41:49.000+0000" -> (known after apply)
      ~ source_code_hash               = "qiHWduLehLrYvBy0ALSwz3thl5SVJybBvJXZo22aLeA=" -> "yvYRFOfZcr41hZ+MAW+jumUycQyg0Dm3AbRuZZJ7dCI="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_all_public_companies_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_all_public_companies_lambda_function" {
        id                             = "demo_get_all_public_companies_lambda_function"
      ~ last_modified                  = "2023-02-03T07:42:19.000+0000" -> (known after apply)
      ~ source_code_hash               = "bQQUrDU0T+ow8iA0ugTAElOcSXXL46NgKiTLqf5w40k=" -> "k53pQetZsqmn917npfAj3faYQJv5w8Rk4wr16T1m5Y0="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_all_ranges_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_all_ranges_lambda_function" {
        id                             = "demo_get_all_ranges_lambda_function"
      ~ last_modified                  = "2023-02-03T07:42:05.000+0000" -> (known after apply)
      ~ source_code_hash               = "Hm8Fq6ensImSqGEBzASJQemVpaQhcB26utSQWNm+69g=" -> "KHvzg4pUiVL77Wl8OcrhSTjQ0c9B9Uol9moCgAU8aXs="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_all_tags_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_all_tags_lambda_function" {
        id                             = "demo_get_all_tags_lambda_function"
      ~ last_modified                  = "2023-02-03T07:41:42.000+0000" -> (known after apply)
      ~ source_code_hash               = "D7vxwMI0VC+WgmYBrV+PsyMwxBx1RQyFqE5IcEqwGm8=" -> "aXieflMbSQ4ITNtDA665YT1unizfblwtgFcNaSicGA4="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_by_metric_report_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_by_metric_report_lambda_function" {
        id                             = "demo_get_by_metric_report_lambda_function"
      ~ last_modified                  = "2023-02-03T07:41:28.000+0000" -> (known after apply)
      ~ source_code_hash               = "gWqGCw6XrIyE0u/IUJSE0A6JJu8Z25yiU6Ga+2Kk2rA=" -> "z2m9S7f31ZHUMaBqa2oXK6NJSk2T5S49098zegnrt2A="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_company_details_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_company_details_lambda_function" {
        id                             = "demo_get_company_details_lambda_function"
      ~ last_modified                  = "2023-02-03T07:41:42.000+0000" -> (known after apply)
      ~ source_code_hash               = "cD9WEkBlxLYRxNUPk5cNRukH+lGUBTQKxKvPn9Ho5Oc=" -> "FdhepCV0xg8+Fmga19NUGYBzCilGTETbwTYZ1t6L+WU="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_company_investments_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_company_investments_lambda_function" {
        id                             = "demo_get_company_investments_lambda_function"
      ~ last_modified                  = "2023-02-03T07:41:31.000+0000" -> (known after apply)
      ~ source_code_hash               = "rJqfftO8Se8mWFrdtNiTao2JTpL3+aY4TZ3MnSxGWUw=" -> "cmDKVeU+mGEXMrD7LlP5QJFZraB4tvWZWW0d2Xln4/M="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_company_permissions_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_company_permissions_lambda_function" {
        id                             = "demo_get_company_permissions_lambda_function"
      ~ last_modified                  = "2023-02-03T07:41:28.000+0000" -> (known after apply)
      ~ source_code_hash               = "krIkaCfsFGAVlqmICq2WWHv8IFTXudxy3FJV6YbHuBg=" -> "0JSHgwcGwX03bglclxVlPSJq+jRUrPDq67jdfxtu+yE="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_company_report_vs_peers_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_company_report_vs_peers_lambda_function" {
        id                             = "demo_get_company_report_vs_peers_lambda_function"
      ~ last_modified                  = "2023-02-03T07:41:43.000+0000" -> (known after apply)
      ~ source_code_hash               = "n8iWEQ25RGECFbHbOxuzv3ZB2qEHc/l/7cBAjWl9cMY=" -> "5o1zNBNsE4znjVolidtGQOx0YSn49QVuzDndtAKTr14="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_comparison_vs_peers_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_comparison_vs_peers_lambda_function" {
        id                             = "demo_get_comparison_vs_peers_lambda_function"
      ~ last_modified                  = "2023-02-03T07:42:05.000+0000" -> (known after apply)
      ~ source_code_hash               = "TBjkuWbuyOKg9OWX6gY0Su80gQD99nJ3Z1VaAqrZ6dM=" -> "FCinsuZgxulDggoN1Q+F0i40xAk+wlZFwigi3exJA5Q="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_dynamic_report_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_dynamic_report_lambda_function" {
        id                             = "demo_get_dynamic_report_lambda_function"
      ~ last_modified                  = "2023-02-03T07:42:19.000+0000" -> (known after apply)
      ~ source_code_hash               = "beXM3QnGZjyKdxt+5bqtjwHcyGgPA4w/pNbLcUelmk4=" -> "i1Gy0auRb4cAft9hhWTLAo42kfO0Dw7HQdHtYlXMNJQ="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_edit_modify_data_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_edit_modify_data_lambda_function" {
        id                             = "demo_get_edit_modify_data_lambda_function"
      ~ last_modified                  = "2023-02-03T07:42:19.000+0000" -> (known after apply)
      ~ source_code_hash               = "8B//IRMBXi6bNtohBuIRcGlVyyIAKz86Eyx2XZudSSQ=" -> "JiypWONXi6nO5fPIZu8ng4nIh4MpTpEqj2E2KqDgrBM="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_full_year_total_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_full_year_total_lambda_function" {
        id                             = "demo_get_full_year_total_lambda_function"
      ~ last_modified                  = "2023-02-03T07:41:54.000+0000" -> (known after apply)
      ~ source_code_hash               = "lC1FmgkT5ZQbpXXEOMskDJpQjlzBPiklYBCd53IGo6s=" -> "VqfJtZe+ote7AgPKDRYibR4xN1SHAHfWj8JpJefTlHQ="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_investment_date_report_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_investment_date_report_lambda_function" {
        id                             = "demo_get_investment_date_report_lambda_function"
      ~ last_modified                  = "2023-02-03T07:41:38.000+0000" -> (known after apply)
      ~ source_code_hash               = "zcQ5pjPZwrGTqp/C89uj9jV3lUiiSUflCSvhmbJk1Z4=" -> "3IvGToY7mpgrmyZylEw631eRX3q+dFHhGX29fz7iMvQ="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_metric_types_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_metric_types_lambda_function" {
        id                             = "demo_get_metric_types_lambda_function"
      ~ last_modified                  = "2023-02-03T07:41:40.000+0000" -> (known after apply)
      ~ source_code_hash               = "6hkOPDDfAMSHBjbFtp+H2Hvdb4sMibwVy+sxoOQ84KM=" -> "DD3fnIqXHqXQqWMKRzJk29mIlX6xIH+R46AR7/nwmG0="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_quarters_report_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_quarters_report_lambda_function" {
        id                             = "demo_get_quarters_report_lambda_function"
      ~ last_modified                  = "2023-02-03T17:16:07.000+0000" -> (known after apply)
      ~ source_code_hash               = "TY/1fuDPZJ3hOWgHtOP/YmC1tKricu8D7bBCffs0KEI=" -> "w6y3KHpyg2J9/JMZXkG4TvZ/oZDAhyFgkzDnqrjbp4k="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_ranges_by_metric_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_ranges_by_metric_lambda_function" {
        id                             = "demo_get_ranges_by_metric_lambda_function"
      ~ last_modified                  = "2023-02-03T07:41:42.000+0000" -> (known after apply)
      ~ source_code_hash               = "aa+vWUHgeNxVQHVVD8Gj5VpG/hEkmwQANxCApQzAoLg=" -> "/2aH9F1UVDVmCsvowIRs98+B1NCDWdkdB5yMIqWitLs="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_roles_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_roles_lambda_function" {
        id                             = "demo_get_roles_lambda_function"
      ~ last_modified                  = "2023-02-03T07:41:54.000+0000" -> (known after apply)
      ~ source_code_hash               = "ObiT14FEby8/jmkhvjoeJtbBpOHtqaNdnu9rJ2OI/y0=" -> "RrOGLMRPa7cpoBoKn+bZps7UNHnEhHe3dgaLkH2+/8g="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_tags_by_company_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_tags_by_company_lambda_function" {
        id                             = "demo_get_tags_by_company_lambda_function"
      ~ last_modified                  = "2023-02-03T07:41:53.000+0000" -> (known after apply)
      ~ source_code_hash               = "ODBb4BnMAwn3pVIokHyP4gdxVjyDsNmP6WbyH1pESjc=" -> "9IEk/A5NbVY8QCtAEtaO8kreQE59qD7fdBkzXafY3bE="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_universe_overview_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_universe_overview_lambda_function" {
        id                             = "demo_get_universe_overview_lambda_function"
      ~ last_modified                  = "2023-02-03T07:41:28.000+0000" -> (known after apply)
      ~ source_code_hash               = "cZ0WGzTSTXuIC/sFj0YOBm8ztcGHIxJOqgvfBdmt+Sk=" -> "HduZBbA1lN6x7FPg7VA2FszaizgLHrMKEPcJklgeLlM="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_user_details_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_user_details_lambda_function" {
        id                             = "demo_get_user_details_lambda_function"
      ~ last_modified                  = "2023-02-03T07:41:28.000+0000" -> (known after apply)
      ~ source_code_hash               = "0SCcUONwwVG00AeW3fUIqRxiNK51RvWR5RF3KnfkBWc=" -> "o+K7YZyXt1lGymqeW3FnQYG9FPy90vK534iHdDNYg14="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_users_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_users_lambda_function" {
        id                             = "demo_get_users_lambda_function"
      ~ last_modified                  = "2023-02-03T07:41:54.000+0000" -> (known after apply)
      ~ source_code_hash               = "F5Bt66sSh13xbtA2O8peJFnWwpsofbM0/zOWM4TbMFw=" -> "Q3uIHePUVFo22ig4ORJoCQS7xuc2V0Q0VslSpWw2Zgc="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.glue_trigger_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "glue_trigger_lambda_function" {
        id                             = "demo_glue_trigger_lambda_function"
      ~ last_modified                  = "2023-02-03T07:42:05.000+0000" -> (known after apply)
      ~ source_code_hash               = "pfiZ/qkphf9P0mQvpw1PmJXwf8hfw5Mjijam9PEsv/0=" -> "G1Dgfc+Pfoq8C93wVN0HXYZJs8iU3nShQrRwnUsPl3o="
        tags                           = {}
        # (18 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.message_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "message_lambda_function" {
        id                             = "demo_message_lambda_function"
      ~ last_modified                  = "2023-02-03T07:42:19.000+0000" -> (known after apply)
      ~ source_code_hash               = "C3IqP8JCpZctg8T0Y0Mjc8j4KKT+f0Ay5K8Jv84C0nA=" -> "pbhfqd8vbGk8G/u3xRyabMD8dj8th4TZrjXNp6ody4E="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.modify_ranges_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "modify_ranges_lambda_function" {
        id                             = "demo_modify_ranges_lambda_function"
      ~ last_modified                  = "2023-02-03T07:42:05.000+0000" -> (known after apply)
      ~ source_code_hash               = "mvZzWvomp7sD//F/8bh/dCPwLg9OjaS/0PSYZzHz5F0=" -> "CNKNcuG0ehEKBEzDIjgJUL9baErod61Mn/DVsJAduuI="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.register_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "register_lambda_function" {
        id                             = "demo_register_lambda_function"
      ~ last_modified                  = "2023-02-03T07:42:16.000+0000" -> (known after apply)
      ~ source_code_hash               = "MmQCYcvj4YCYnCa8nPjCdA8lZNhk7MLJsvzdZF8e10M=" -> "tH0B+Zh04Wl46GoNCjVOrhK+7Ffws15gFX7uaI5eZaw="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.update_data_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "update_data_lambda_function" {
        id                             = "demo_update_data_lambda_function"
      ~ last_modified                  = "2023-02-03T07:42:10.000+0000" -> (known after apply)
      ~ source_code_hash               = "/aOdUCsru9JBvpom/W/5LPfl8eaOAaBfwo5eG+/rKEs=" -> "+Cs3sCTwznucWH3KwduW61OUPCknBbgNrbCedffPWuY="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.update_tags_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "update_tags_lambda_function" {
        id                             = "demo_update_tags_lambda_function"
      ~ last_modified                  = "2023-02-03T07:42:06.000+0000" -> (known after apply)
      ~ source_code_hash               = "Gqoo3Sb/iM7P25W3RFv6LRii8lUfhqXxPf+wF7YyJ2Y=" -> "Hzqdr1sim1ZkF2VF9mwOvw0Ss6oATyuP2k7Y8JzQz6Q="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.upload_file_s3_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "upload_file_s3_lambda_function" {
        id                             = "demo_upload_file_s3_lambda_function"
      ~ last_modified                  = "2023-02-03T07:41:54.000+0000" -> (known after apply)
      ~ source_code_hash               = "g72H21hzjs5j+x0s/n1xP8hBuwU3VQ/c+S8NacRWwRk=" -> "HF1fIJFQgGrOY5HBn7KidcENBFK/xaVyp4EFqJ/GqSk="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.validate_data_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "validate_data_lambda_function" {
        id                             = "demo_validate_data_lambda_function"
      ~ last_modified                  = "2023-02-03T07:41:42.000+0000" -> (known after apply)
      ~ source_code_hash               = "QUA1r8+lCwOGtqRRbBKW19SQa33cWhdDO3cW6PFXPbI=" -> "fDbjoujAEjBsfFLT5aFcw1QIC5PNz6JIePPj1HRaUIo="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.verify_users_with_same_email_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "verify_users_with_same_email_lambda_function" {
        id                             = "demo_verify_users_with_same_email_lambda_function"
      ~ last_modified                  = "2023-02-03T07:42:19.000+0000" -> (known after apply)
      ~ source_code_hash               = "Jt04wz7VQqw+29CemxqdsUdykAe06EojceTyr9p+lKY=" -> "0DGn4KCtFgDAtzXSWtgG/ekpUnUq6iEZqqf7fCfPV9s="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.gateway_deployment.aws_api_gateway_deployment.gateway_deployment must be replaced
+/- resource "aws_api_gateway_deployment" "gateway_deployment" {
      ~ created_date      = "2023-02-03T07:41:23Z" -> (known after apply)
      ~ execution_arn     = "arn:aws:execute-api:us-west-2:435552912911:kb7gblbu69/demo" -> (known after apply)
      ~ id                = "30bbte" -> (known after apply)
      ~ invoke_url        = "https://kb7gblbu69.execute-api.us-west-2.amazonaws.com/demo" -> (known after apply)
      ~ stage_description = "Deployed at 2023-02-03T07:41:21Z" -> (known after apply) # forces replacement
        # (2 unchanged attributes hidden)
    }

  # module.network.aws_apigatewayv2_deployment.deploy will be updated in-place
  ~ resource "aws_apigatewayv2_deployment" "deploy" {
      ~ description   = "Deployed at 2023-02-03T07:41:21Z" -> (known after apply)
        id            = "ey3sgf"
        # (2 unchanged attributes hidden)
    }

  # module.network.aws_apigatewayv2_stage.stage will be updated in-place
  ~ resource "aws_apigatewayv2_stage" "stage" {
        id              = "demo"
        name            = "demo"
        tags            = {}
        # (8 unchanged attributes hidden)

      - access_log_settings {
          - destination_arn = "arn:aws:logs:us-west-2:435552912911:log-group:testing_websocket_api" -> null
          - format          = jsonencode(
                {
                  - caller       = "$context.identity.caller"
                  - connectionId = "$context.connectionId"
                  - eventType    = "$context.eventType"
                  - ip           = "$context.identity.sourceIp"
                  - requestId    = "$context.requestId"
                  - requestTime  = "$context.requestTime"
                  - routeKey     = "$context.routeKey"
                  - status       = "$context.status"
                  - user         = "$context.identity.user"
                }
            ) -> null
        }

        # (1 unchanged block hidden)
    }

Plan: 1 to add, 95 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didnt use the -out option to save this plan, so Terraform cant
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>

*Pusher: @dsgarcia8, Action: `pull_request`*